Repository: OlegQm/stubarag
Catalog: frontend/locales/*/LC_MESSAGES/*.po
Languages: sk

source: New Conversation
sk: Nová konverzácia

source: Conversation History
sk: História konverzácií

source: Log out
sk: Odhlásiť sa

source: Current chat
sk: Aktuálny chat

source: What is on your mind,
sk: Neváhaj mi položiť otázku, milý

source: Contact PGO
sk: Kontaktovať PGO

source: Your message to PGO
sk: Vaša správa pre PGO

source: Dear PGO...
sk: Vážené PGO...

source: Send
sk: Odoslať

source: Good answer
sk: Dobrá odpoveď

source: Bad answer
sk: Zlá odpoveď

source: Regenerate answer
sk: Vygenerovať odpoveď znova

source: Log in
sk: Prihlásenie

source: You have been logged out due to inactivity
sk: Boli ste odhlásení z dôvodu neaktivity

source: Something went wrong...
sk: Niečo sa pokazilo...

source: Sources
sk: Zdroje

source: Hey, I found this information in my databases. Is this what you are looking for?
sk: Takúto informáciu som našiel vo svojich databázach... Je to to, čo hľadáte ?

source: Conversation reached the end. Please start a new conversation.
sk: Bol dosiahnutý koniec konverzácie. Prosím, začnite novú konverzáciu.

source: End of conversation reached. At the end of the conversation, I will write an email for you to send to the study department.
sk: Bol dosiahnutý koniec konverzácie. Na konci konverzácie pre Vás napíšem mail určený pre Pedagogické oddelenie.

source: Researching...
sk: Vyhľadávam informácie...

source: 🔍The list is empty
sk: 🔍Zoznam je prázdny

source: Show all questions
sk: Zobraziť všetky otázky

source: Show all news
sk: Zobraziť všetky novinky
