Repository: OlegQm/stubarag
Catalog: admin/locales/*/LC_MESSAGES/*.po
Languages: sk

source: Control panel
sk: Ovládací panel

source: Conversations review
sk: Kontrola konverzácií

source: Knowledge base
sk: Báza znalostí

source: Conversation history
sk: História konverzácií

source: Statistics
sk: Štatistika

source: Log out
sk: Odhlásiť sa

source: Chat App Management
sk: Správa chat aplikácie

source: :material/logout: Log out is disabled when logged in as _Guest_
sk: :material/logout: Ste prihlasení ako _Hosť_, odhlásenie je deaktivované

source: 🖥️ Control panel of :blue[FEI RAGBOT]
sk: 🖥️ Ovládací panel :blue[FEI RAGBOT]

source: Welcome to the administration interface of FEI RAGbot app
sk: Vitajte v administrátorskom rozhraní aplikácie FEI RAGbot

source: 💭 Conversation history
sk: 💭 História konverzácií

source: Upload a file
sk: Nahrajte súbor

source: 📚 Knowledge base
sk: 📚 Báza znalostí

source: 📊 Statistics
sk: 📊 Štatistika

source: Here will be some statistics about RAGbot usage.
sk: Tu bude štatistika využívania RAGbota.

source: Drag and drop file here
sk: Nahrajte súbor kliknutím alebo presunutím sem

source: Limit 200MB per file
sk: Limit 200MB na jeden súbor

source: Browse files
sk: Prehliadať súbory

source: ⚠️Error during deleting of:
sk: ⚠️Chyba počas vymazávania záznamu:

source: ⚠️Error during unlearning of:
sk: ⚠️Chyba počas odnaučenia záznamu:

source: ⚠️Error during learning of:
sk: ⚠️Chyba počas učenia sa záznamu:

source: Conversation details
sk: Detail konverzácie

source: Back
sk: Späť

source: Document details
sk: Detail dokumentu

source: UPLOAD FILE
sk: NAHRAJ SÚBOR

source: Delete
sk: Vymaž

source: Unlearn
sk: Zabudni

source: Learn
sk: Nauč sa

source: Selected:
sk: Vybrané:

source: Details
sk: Detail

source: Selection actions:
sk: Vyber akciu:

source: Name
sk: Názov

source: Date
sk: Dátum

source: Author
sk: Autor

source: Size
sk: Veľkosť

source: Ingested
sk: Naučené

source: Type
sk: Typ

source: Requested document does not exist:
sk: Požadovaný dokument sa nenašiel:

source: Description
sk: Téma konverzácie

source: User
sk: Používateľ

source: Feedback
sk: Hodnotenie

source: Review
sk: Kontrola

source: Reviewed by
sk: Kontrolór

source: Requested conversation does not exist:
sk: Požadovaná konverzácia sa nenašla

source: Log in
sk: Prihlásenie

source: You have been logged out due to inactivity
sk: Boli ste odhlásení z dôvodu neaktivity

source: Something went wrong...
sk: Niečo sa pokazilo...

source: ACCESS REJECTED: Only members of _admin_ group can access admin interface !
sk: PRÍSTUP ODMIETNUTÝ: Iba členovia skupiny _admin_ majú prístup k správcovskému rozhraniu !

source: Admin Interface
sk: Správcovské rozhranie

source: Failed to recognize file type ! File formatting may be broken.
sk: Nepodarilo sa rozpoznať formát súboru ! Súbor môže byť poškodený.

source: Unsupported file type !
sk: Nepodporovaný typ súboru !

source: Error processing file
sk: Chyba pri spracovaní súboru

source: Error processing ZIP file
sk: Chyba pri spracovaní ZIP súboru

source: ZIP file uploaded successfully
sk: ZIP súbor bol úspešne nahraný

source: ⚠️Something went wrong, try again later⚠️
sk: ⚠️Niečo sa pokazilo, skúste znova neskôr⚠️

source: Upload process finished successfully
sk: Nahrávanie prebehlo úspešne

source: ⚠️Webscraper process failed
sk: ⚠️Scrapovanie stránky zlyhalo

source: Webscraper process finished successfully
sk: Scrapovanie stránky prebehlo úspešne

source: ⚠️Upload process failed
sk: ⚠️Nahrávanie zlyhalo

source: Enter information about webpage
sk: Zadajte údaje o webovej stránke

source: Description of the website
sk: Popis stránky

source: Enter question and answer pair
sk: Zadajte dvojicu otázka a odpoveď

source: Question
sk: Otázka

source: Answer
sk: Odpoveď

source: Submit
sk: Potvrdiť

source: ⚠️URL is empty!
sk: ⚠️URL je prázdna!

source: ⚠️Description is empty!
sk: ⚠️Popis je prázdny!

source: Upload a file with descriptions and URLs
sk: Nahrajte súbor s popismi a URL adresami

source: START SCRAPING
sk: ZAČAŤ SCRAPOVAŤ

source: ⚠️Question is empty!
sk: ⚠️Otázka je prázdna!

source: ⚠️Answer is empty!
sk: ⚠️Odpoveď je prázdna!

source: Webscraper page details
sk: Detail stránky

source: Deleting of pages finished
sk: Zmazanie stránok dokončené

source: Web description
sk: Popis stránky

source: Delete process finished ✔
sk: Mazanie bolo dokončené ✔

source: Learn process finished ✔
sk: Učenie bolo dokončené ✔

source: Unlearn process finished ✔
sk: Odnaučenie bolo dokončené ✔

source: ⚠️Error during deleting of FAQ
sk: ⚠️Chyba počas vymazávania FAQ

source: 🔍The list is empty
sk: 🔍Zoznam je prázdny

source: ⚠️Read timeout occurred. Failed to learn:
sk: ⚠️Server príliš dlho neodpoveda. Nepodarilo sa naučiť dokument:

source: ⚠️Connection timeout occurred. Failed to learn:
sk: ⚠️Vypršal čas na spojenie so serverom. Nepodarilo sa naučiť dokument:

source: ⚠️HTTP error occurred. Failed to learn:
sk: ⚠️Nastala chyba HTTP spojenia. Nepodarilo sa naučiť dokument:

source: ⚠️Something went wrong. Failed to learn:
sk: ⚠️Niečo sa pokazilo. Nepodarilo sa naučiť dokument:

source: No conversations for review
sk: Žiadne konverzácie na kontrolu

source: Number of conversations to be reviewed:
sk: Počet konverzácií na kontrolu:

source: All conversations are already reviewed! 🎉🥳 Come back later.
sk: Všetky konverzácie boli prejdené! 🎉🥳 Skontrolujte znova neskôr.

source: Previous conversation
sk: Predchádzajúca konverzácia

source: Next conversation
sk: Nasledujúca konverzácia

source: No conversation content to display
sk: Konverzácia nemá obsah, ktorý by sa dal zobraziť

source: Conversation has already been reviewed as GOOD ✅!
sk: Konverzácia už bola ohodnotená ako DOBRÁ ✅!

source: Conversation has already been reviewed as BAD ❌!
sk: Konverzácia už bola ohodnotená ako ZLÁ ❌!

source: ❌ Bad conversation
sk: ❌ Zlá konverzácia

source: ✅ Good conversation
sk: ✅ Dobrá konverzácia

source: Bulk insert
sk: Hromadné nahratie
